//-----------------------------------------------------------------
//  名称: 分立式数码管循环显示0~9
//-----------------------------------------------------------------
//  说明: 主程序中的循环语句反复将0~9的段码送至指定端口引脚，形成数字0~9的循环显示.
//
//-----------------------------------------------------------------
//0~9的共阳数码管段码表
const uint8_t CA_SEGCODE[] = 
{ 0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90};
  int i,j;
  //用数组指定7段数码管所连接的引脚
  int ledPins[] = { 0, 1, 2, 3, 4, 5, 6, 7 };
void setup() 
{
for(int i=0;i<8;i++)
pinMode(ledPins[i],OUTPUT);
}
 
void loop() 
{
 for(i=0;i<10;i++)
 {
  for(j=0;j<7;j++)
  {
if((CA_SEGCODE[i] >> j) & 0x01 == 1)
digitalWrite(ledPins[j],HIGH);
else 
digitalWrite(ledPins[j],LOW); 
  }
  delay(300);
 }
}
